"""
Узнайте у пользователя число n.
Найдите сумму чисел n + nn + nnn.
Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.
"""

# Формирую три числа с помощью конкатенации и преобразования в число
# Суммирую три числа
user_num = input("Введите число от 1 до 9: ")
num_1 = int(user_num * 1)
num_2 = int(user_num * 2)
num_3 = int(user_num * 3)
answer = num_1 + num_2 + num_3
print(answer)

# Преобразую в число введенное значение и умножаю на 123
answer_2 = int(user_num) * 123
print(answer_2)

# С помощью цикла, конкатенации и преобразования в число нахожу ответ
i = 0
count = 3
answer_3 = 0
while i < count:
    i += 1
    answer_3 += int(user_num * i)
print(answer_3)
